/*********************************************************************
Программа управления дисплеем из состава платы Accessory Shield
Подключение по I2C
Линия сброса задана аппаратно и подключена к выводу D7 
*********************************************************************/

 //========================================================================
 //---------------------------- ПОДКЛЮЧАЕМЫЕ ФАЙЛЫ ------------------------
 //========================================================================
#include <SPI.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

 //========================================================================
 //-------------------------------- КОНСТАНТЫ -----------------------------
 //========================================================================
#define SERIAL_SPEED 115200 
#define PAUSE 2000

#define OLED_RESET 7                    // линия аппаратного сброса микросхемы контроллера дисплея
#define DISPLAY_I2C_ADDRESS 0x3C        // адрес контроллера дисплея на шине I2C

#define DEFAULT_SIZE 1                  // размер текста по умолчанию
#define HOME_COLUMN 0                   // столбец по умолчанию
#define HOME_LINE 0                     // строка по умолчанию
#define TITLE "Accessory shield v1.0"   // Начальный текст

 //========================================================================
 //--------------------------- ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ ----------------------
 //========================================================================
Adafruit_SSD1306 display(OLED_RESET);

//=====================================================================
// Начальная установка
//=====================================================================
void setup()   {                
  Serial.begin(SERIAL_SPEED);
  // Начальная установка дисплея
  display.begin(SSD1306_SWITCHCAPVCC, DISPLAY_I2C_ADDRESS); 
  // Отображение логотипа, записанного в резидентной памяти
  display.display();
  
  delay(PAUSE);

  // Очистка буфера диспля
  display.clearDisplay();
  delay(PAUSE);
  // Начальная заставка
  display.setTextSize(DEFAULT_SIZE);
  display.setTextColor(WHITE);
  display.setCursor(HOME_COLUMN,HOME_LINE);
  display.println(TITLE);
  display.display();
  delay(PAUSE);

}//End of woid install()


//=====================================================================
// Главный цикл
//=====================================================================
void loop() 
{
  
}//End of void loop()


//=====================================================================
// Подпрограммы
//=====================================================================

